[
  {
    "title": "Website Catering Online",
    "category": "Web Development",
    "technologies": "PHP, JavaScript, SCSS, HTML, CSS",
    "mainImage": "https://drive.google.com/thumbnail?id=19eNXBm6i9QSQutVO6r9TV0sshfPIBm44",
    "description": "Website catering online yang memudahkan pelanggan memesan berbagai paket menu catering seperti nasi box, snack box, prasmanan, dan tumpeng. Website ini memiliki dua role utama yaitu user dan admin, dengan fitur lengkap untuk pemesanan, manajemen menu, serta laporan penjualan. https://github.com/Jesaurel/Jessica13_Catering",
    "detailImage1": "https://drive.google.com/thumbnail?id=19rCeBgL0LZiiJHin6lxM0Qf8nyM_2252",
    "challenge": "Membangun sistem catering online dari nol dengan alur login, pemesanan, manajemen menu, dan laporan, serta memastikan keamanan data dan kemudahan penggunaan.",
    "solution": "Menggunakan validasi PHP, manajemen session, dan desain responsif berbasis SCSS dan Tailwind CSS. Penerapan flow login dengan role-based access untuk membedakan akses user dan admin.",
    "detailImage2": "https://drive.google.com/thumbnail?id=19fi-oujfrQfzMfFHvQkrsaOciIKp9MMm",
    "features": [
      "Halaman utama (Homepage) yang bisa diakses tanpa login",
      "Autentikasi Login & Register (Role User & Admin)",
      "User dapat memesan catering, edit profil, memberi ulasan, dan melihat histori pesanan",
      "Admin dashboard untuk CRUD menu & kategori, kelola user, ubah status pesanan, dan melihat laporan",
      "Status pesanan: diproses, dikirim, selesai",
      "Layout responsif untuk desktop dan mobile"
    ],
    "impact": "Project ini merupakan tugas akhir (projek mandiri) untuk memenuhi syarat kelulusan SMK jurusan Pengembangan Perangkat Lunak dan Gim (PPLG). Website ini berhasil menyelesaikan studi kasus bisnis catering dan digunakan dalam simulasi pemesanan riil.",
    "sidebar": {
      "category": "Web Development",
      "client": "Tugas Akhir SMK (Projek Mandiri)",
      "duration": "3 bulan",
      "date": "Januari - Maret 2025"
    }
  },
  {
  "title": "Kalkulator Sederhana Python Tkinter",
  "category": "Python GUI Application",
  "technologies": "Python, Tkinter",
  "mainImage": "https://drive.google.com/thumbnail?id=19eNXBm6i9QSQutVO6r9TV0sshfPIBm44",
  "description": "Kalkulator sederhana menggunakan Python dan Tkinter dengan tampilan modern dan warna lembut. Fitur: penambahan, pengurangan, perkalian, pembagian, clear, backspace, dan auto-formatting hasil. Cocok untuk berbagai usia dengan antarmuka yang mudah digunakan. https://github.com/Jesaurel/kalkulator",
  "detailImage1": "https://drive.google.com/thumbnail?id=19rCeBgL0LZiiJHin6lxM0Qf8nyM_2252",
  "challenge": "Membuat aplikasi kalkulator GUI yang sederhana, mudah digunakan, dan mencakup operasi matematika dasar serta beberapa fungsi tambahan.",
  "solution": "Menggunakan Python dan pustaka Tkinter untuk membangun antarmuka pengguna. Mengimplementasikan fungsi untuk setiap tombol operasi dan menggunakan fungsi `eval()` untuk mengevaluasi ekspresi matematika.",
  "detailImage2": "https://drive.google.com/thumbnail?id=19fi-oujfrQfzMfFHvQkrsaOciIKp9MMm",
  "features": [
    "Operasi matematika dasar: penjumlahan (+), pengurangan (-), perkalian (*), dan pembagian (/)",
    "Fungsi Clear (C) untuk menghapus seluruh input",
    "Fungsi Backspace (DEL) untuk menghapus karakter terakhir",
    "Fungsi akar kuadrat (sqrt)",
    "Fungsi pangkat (^)",
    "Fungsi logaritma (log)",
    "Fungsi trigonometri: sin, cos, tan",
    "Validasi input keyboard untuk memastikan hanya karakter yang valid yang dapat dimasukkan",
    "Antarmuka pengguna yang sederhana dan mudah digunakan",
    "Auto-formatting hasil (bergantung pada output `eval()`)"
  ],
  "impact": "Proyek ini cocok untuk pemula yang ingin mempelajari dasar-dasar Python dan pembuatan GUI menggunakan Tkinter. Menunjukkan implementasi operasi matematika dan penanganan input pengguna dalam aplikasi GUI.",
  "sidebar": {
    "category": "Python GUI Application",
    "client": "Proyek Pribadi",
    "duration": "Singkat",
    "date": "Dibuat sekitar 10 bulan lalu (berdasarkan aktivitas GitHub)"
  },
  "githubUrl": "https://github.com/JessicaAurelClarista/kalkulator",
  "liveDemoUrl": null,
  "apkUrl": null,
  "detailImageUrl": null
  },
  {
  "title": "Password Generator Web App",
  "category": "Web Application",
  "technologies": "HTML5, CSS3, JavaScript (Vanilla), Anime.js",
  "mainImage": "https://drive.google.com/thumbnail?id=h19zZIzP_udezguxVwolY-4EAnmlPw0-Dk",
  "description": "Generator kata sandi sederhana berbasis web yang memungkinkan pengguna untuk membuat kata sandi dengan berbagai tingkat kompleksitas dan panjang. Dibuat menggunakan HTML, CSS, dan JavaScript, dilengkapi animasi logo dan indikator kekuatan kata sandi. https://github.com/Jesaurel/password-generator",
  "detailImage1": "https://drive.google.com/thumbnail?id=1A0B4DRV1H9jVOtlN0lrpO_xjojyxVyFN",
  "challenge": "Membangun aplikasi web generator kata sandi yang aman, mudah digunakan, dengan fitur pemilihan panjang dan kompleksitas, indikator kekuatan, dan animasi visual.",
  "solution": "Menggunakan HTML untuk struktur, CSS untuk tampilan glassmorphism yang modern, JavaScript untuk logika generator dan indikator kekuatan, serta Anime.js untuk animasi logo SVG yang interaktif. Implementasi Clipboard API untuk fitur salin ke clipboard.",
  "detailImage2": "https://drive.google.com/thumbnail?id=1A7ZcpMYzaYijQlix-EOmi--9CBu2hQ_h",
  "features": [
    "Pilihan panjang kata sandi (6–20 karakter)",
    "Pilihan tingkat kompleksitas:",
    "  - Level 1: Huruf saja (a–z, A–Z)",
    "  - Level 2: Huruf + Angka",
    "  - Level 3: Huruf + Angka + Simbol",
    "Indikator kekuatan kata sandi (Weak, Medium, Strong) dengan perubahan warna",
    "Tombol salin ke clipboard",
    "Animasi logo interaktif menggunakan Anime.js",
    "Desain antarmuka glassmorphism yang modern dan lembut",
    "Responsif untuk berbagai ukuran layar"
  ],
  "impact": "Memberikan solusi sederhana dan aman bagi pengguna untuk menghasilkan kata sandi yang kuat dan acak, meningkatkan keamanan akun online mereka. Proyek ini juga menunjukkan integrasi animasi dan fitur modern dalam aplikasi web sederhana.",
  "sidebar": {
    "category": "Web Application",
    "client": "Proyek Pribadi",
    "duration": "Singkat",
    "date": "Dibuat sekitar 2 menit lalu (berdasarkan aktivitas GitHub)"
  },
  "githubUrl": "https://github.com/Jesaurel/password-generator",
  "liveDemoUrl": null,
  "apkUrl": null,
  "detailImageUrl": null
  },
      {
      "title": "Aplikasi To-Do List Desktop (Python, Tkinter)",
      "category": "Aplikasi Desktop",
      "technologies": "Python, Tkinter",
      "mainImage": "https://drive.google.com/thumbnail?id=1AkLgLM_YIesqydKLYFXqcOZnOHABfzC-",
      "description": "Aplikasi To-Do List desktop yang dibangun dengan Python dan Tkinter, menyediakan antarmuka pengguna yang intuitif untuk mengelola tugas. Aplikasi ini memiliki tema gelap yang modern dan fitur-fitur penting untuk meningkatkan produktivitas. https://github.com/Jesaurel/todo-list",
      "detailImage1": "https://drive.google.com/thumbnail?id=d/1AIm3OXYmza7ycofR2uDXlpr-eVDqjt4h",
      "challenge": "Membangun aplikasi desktop yang responsif dan mudah digunakan untuk manajemen tugas, dengan fokus pada desain antarmuka yang bersih dan tema gelap.",
      "solution": "Mengembangkan GUI menggunakan Tkinter, dengan struktur aplikasi yang modular menggunakan frame dan label. Mengimplementasikan fungsi-fungsi untuk menambah, mengedit, menghapus, dan menyelesaikan tugas. Menggunakan dialog kustom untuk input pengguna dan menerapkan tema gelap yang konsisten.",
      "detailImage2": "https://drive.google.com/thumbnail?id=1AIRag2KkqLSYA_PRpyoMthuctirmZmMX",
      "features": [
        "Tambah tugas baru dengan dialog input kustom",
        "Edit tugas yang sudah ada",
        "Hapus tugas individual",
        "Tandai tugas sebagai selesai",
        "Hapus semua tugas",
        "Tema gelap yang konsisten",
        "Tata letak responsif",
        "Penggunaan font Poppins",
        "Dialog kustom untuk interaksi pengguna"
      ],
      "impact": "Aplikasi ini memberikan solusi yang sederhana dan efisien untuk mengelola tugas di desktop. Proyek ini menunjukkan kemampuan dalam pengembangan aplikasi GUI Python dengan Tkinter dan pemahaman tentang prinsip-prinsip desain antarmuka pengguna.",
      "sidebar": {
        "category": "Aplikasi Desktop",
        "client": "Proyek Pribadi",
        "duration": "Singkat",
        "date": "2025"
      },
      "githubUrl": "https://github.com/Jesaurel/your-todo-list-repo",
      "liveDemoUrl": null,
      "apkUrl": null,
      "detailImageUrl": null,
      "videoDemoUrl": "URL_VIDEO_DEMO"
    }
    
]
